{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and a public contact form, with admin-only queries for viewing submissions and counts.",
  "feature_evidence.json": "Machine-readable report mapping implemented frontend features to files, components, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all frontend source files, components, hooks, and configuration for documentation and planning.",
  "frontend/index.css": "Tailwind CSS entry file defining global design tokens, OKLCH color variables, light/dark themes, and base element styles.",
  "frontend/index.html": "HTML entry point that sets metadata, page title, and mounts the React application to the root div.",
  "frontend/src/App.tsx": "Root React component composing the full landing page by rendering header, all content sections, and footer in order.",
  "frontend/src/components/charts/RiskBarChart.tsx": "Simple SVG-free bar chart component visualizing low, medium, and high risk levels as animated horizontal bars.",
  "frontend/src/components/charts/SimpleLineChart.tsx": "Renders a simple responsive SVG line chart with hardcoded semester performance data, including grid lines, area fill, data points, and labels.",
  "frontend/src/components/demos/AdmissionsEligibilityDemo.tsx": "Interactive demo form that checks college course eligibility based on marks, category, and course using simple rule-based logic and displays a success or failure message.",
  "frontend/src/components/demos/ChatbotMock.tsx": "Mock AI chatbot UI with predefined keyword-based responses for common college queries, simulating message exchange with delayed bot replies.",
  "frontend/src/components/FeatureCard.tsx": "Reusable card component displaying an icon, title, and description with hover effects and staggered fade-in animation.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, quick navigation links, social media icons, and a copyright bar.",
  "frontend/src/components/forms/ContactForm.tsx": "Contact form component that collects user details and submits them via a custom hook, handling loading, success, and error states with visual feedback.",
  "frontend/src/components/Header.tsx": "Sticky responsive navigation header with smooth-scroll links, scroll state styling, and mobile menu toggle.",
  "frontend/src/components/sections/AboutSection.tsx": "Static informational section describing the Smart College System, its mission, vision, and future scope of AI in education using styled content blocks.",
  "frontend/src/components/sections/AnalyticsSection.tsx": "Dashboard section showcasing analytics features, embedding performance and risk charts along with descriptive text and AI-driven improvement suggestions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Renders a three-column benefits section highlighting tailored advantages for students, faculty, and administrators using icon-labeled cards and bullet lists.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays a contact section with a contact form, institutional contact details (email, phone, address), and office hours in a two-column responsive layout.",
  "frontend/src/components/sections/DashboardPreviewSection.tsx": "Shows a preview section with mock dashboard images and captions to demonstrate analytics, attendance, and marks tracking features.",
  "frontend/src/components/sections/FaceAttendanceDemoSection.tsx": "Presents a conceptual demo of face recognition attendance, including workflow steps, mock camera UI, diagrams, and listed benefits without real biometric processing.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Defines and renders a grid of core AI-driven platform features using reusable FeatureCard components and descriptive metadata.",
  "frontend/src/components/sections/HeroSection.tsx": "Implements the landing hero section with headline messaging, call-to-action buttons that smooth-scroll to sections, and a prominent illustrative image.",
  "frontend/src/components/sections/InteractiveDemosSection.tsx": "Renders a section containing interactive demo components for admissions eligibility checking and a chatbot mock interface.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages a backend actor using React Query, handling authenticated vs anonymous identities and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context, hook, and provider to manage Internet Identity authentication using DFINITY AuthClient, including login, logout, persisted identities, and detailed login status flags.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a React Query mutation hook that submits contact form data via a backend actor and invalidates related cached queries on success.",
  "frontend/src/index.css": "Global Tailwind CSS styles defining a blue/white academic theme with CSS variables, light/dark modes, typography, accessibility focus styles, and reusable animation utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and the Internet Identity provider and loading global styles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and safely clearing sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, plugins, container settings, and extensive theme extensions mapped to CSS variables for colors, typography, and animations.",
  "project_state.json": "Tracks high-level project goals, features, and versions for the Smart College System marketing website, including required sections, UI theme, and planned interactive demos."
}